Revit 2027 API
ElementIsElementTypeFilter Class
 A filter used to match elements which are ElementTypes.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.ElementFilter
 Autodesk.Revit.DB.ElementQuickFilter
 Autodesk.Revit.DB.ElementIsElementTypeFilter
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class ElementIsElementTypeFilter : ElementQuickFilter
Public Class ElementIsElementTypeFilter
	Inherits ElementQuickFilter
public ref class ElementIsElementTypeFilter : public ElementQuickFilter
type ElementIsElementTypeFilter =
    class
        inherit ElementQuickFilter
    end
The ElementIsElementTypeFilter type exposes the following members.
Constructors
Name | Description
ElementIsElementTypeFilter() |  Constructs a new instance of a filter to match only ElementTypes.
ElementIsElementTypeFilter(Boolean) |  Constructs a new instance of a filter to match only ElementTypes, with the option to match all elements which are not ElementTypes.
Top
Properties
Name | Description
Inverted |  True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
(Inherited from ElementFilter)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ElementFilter)
Top
Methods
Name | Description
Dispose
(Inherited from ElementFilter)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
PassesFilter(Element) |  Applies the filter to a given element.
(Inherited from ElementFilter)
PassesFilter(Document, ElementId) |  Applies the filter to a given element.
(Inherited from ElementFilter)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
Remarks
 This filter is a quick filter. Quick filters operate only on the ElementRecord, a low-memory class which has a limited interface to read element properties. Elements which are rejected by a quick filter will not be expanded in memory.
See Also
Reference
Autodesk.Revit.DB Namespace